## `terraform/main`
#### Terraform Format and Style 🖌`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.ecr.aws_ecr_repository.repos: Refreshing state... [id=lambda-sample-ecr]
aws_iam_role.lambda-sample-role: Refreshing state... [id=lambda-sample-role]
aws_iam_role_policy_attachment.lambda: Refreshing state... [id=lambda-sample-role-20240916020901985000000001]
aws_lambda_function.function: Refreshing state... [id=lambda-sample-function]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_apigatewayv2_api.api will be created
  + resource "aws_apigatewayv2_api" "api" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "lambda-sample-api"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = {
          + "owner"     = "okmtdev"
          + "service"   = "lambda-sample"
          + "terraform" = "true"
        }
    }

  # aws_apigatewayv2_integration.integration will be created
  + resource "aws_apigatewayv2_integration" "integration" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:761624429622:function:lambda-sample-function/invocations"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.route will be created
  + resource "aws_apigatewayv2_route" "route" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "ANY /"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_stage.stage will be created
  + resource "aws_apigatewayv2_stage" "stage" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags_all      = {
          + "owner"     = "okmtdev"
          + "service"   = "lambda-sample"
          + "terraform" = "true"
        }
    }

  # aws_lambda_function_url.function-url will be created
  + resource "aws_lambda_function_url" "function-url" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "lambda-sample-function"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + invoke_mode        = "BUFFERED"
      + url_id             = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>